In [1]:
import pandas as pd
import numpy as np

## 1. Pandas Pivot, Long to Wide format Conversion

In [2]:
raw_data = {'patient':[1,1,1,2,2], \
           'obs': [1,2,3,1,2], \
        'treatment':[0,1,0,1,0],\
        'score':[6252,24243,2345,2342,23525]}

In [5]:
df = pd.DataFrame(raw_data,columns=list(raw_data.keys()))
df

   patient  obs  treatment  score
0        1    1          0   6252
1        1    2          1  24243
2        1    3          0   2345
3        2    1          1   2342
4        2    2          0  23525

### Using <code>pivot()</code>

In [6]:
df.pivot(index='patient',columns='obs',values='score')

obs           1        2       3
patient
1        6252.0  24243.0  2345.0
2        2342.0  23525.0     NaN

## 2. Pandas <code>melt()</code> Wide to Long Format COnversion

In [10]:
col_labels_order=['Category','0 to 100','101 to 200','201 to 300']
category_ranges_df = pd.DataFrame({'Category':['A','B','C','D','E'],
                                      '0 to 100' : [1,2,3,4,5],
                                      '101 to 200' : [10,20,30,40,50],
                                      '201 to 300' : [100,200,300,400,500]}, columns=col_labels_order)
category_ranges_df

  Category  0 to 100  101 to 200  201 to 300
0        A         1          10         100
1        B         2          20         200
2        C         3          30         300
3        D         4          40         400
4        E         5          50         500

In [12]:
category_ranges_df_melted = pd.melt(category_ranges_df,id_vars=['Category'])
category_ranges_df_melted

   Category    variable  value
0         A    0 to 100      1
1         B    0 to 100      2
2         C    0 to 100      3
3         D    0 to 100      4
4         E    0 to 100      5
5         A  101 to 200     10
6         B  101 to 200     20
7         C  101 to 200     30
8         D  101 to 200     40
9         E  101 to 200     50
10        A  201 to 300    100
11        B  201 to 300    200
12        C  201 to 300    300
13        D  201 to 300    400
14        E  201 to 300    500

## 3. DF to Numpy Array

In [13]:
df1 = pd.DataFrame([[21, 72, 67],[23, 78, 69],[32, 74, 56],[52, 54, 76]],columns=['a', 'b', 'c'])

In [14]:
df1

    a   b   c
0  21  72  67
1  23  78  69
2  32  74  56
3  52  54  76

In [16]:
df1.values

array([[21, 72, 67],
       [23, 78, 69],
       [32, 74, 56],
       [52, 54, 76]], dtype=int64)

In [18]:
array1 = df1.to_numpy()

In [19]:
array1

array([[21, 72, 67],
       [23, 78, 69],
       [32, 74, 56],
       [52, 54, 76]], dtype=int64)

In [20]:
array1[0,2]

67

## 4. Stack/Unstack Pandas

In [21]:
import pandas as pd
import numpy as np
 
header = pd.MultiIndex.from_product([['Semester1','Semester2'],['Maths','Science']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
 
df = pd.DataFrame(d,
                  index=['Alisa','Bobby','Cathrine','Jack'],
                  columns=header)
df

         Semester1         Semester2
             Maths Science     Maths Science
Alisa           12      45        67      56
Bobby           78      89        45      67
Cathrine        45      67        89      90
Jack            67      44        56      55

In [22]:
stacked_df=df.stack()
stacked_df

                  Semester1  Semester2
Alisa    Maths           12         67
         Science         45         56
Bobby    Maths           78         45
         Science         89         67
Cathrine Maths           45         89
         Science         67         90
Jack     Maths           67         56
         Science         44         55

In [23]:
stacked_df.index

MultiIndex([(   'Alisa',   'Maths'),
            (   'Alisa', 'Science'),
            (   'Bobby',   'Maths'),
            (   'Bobby', 'Science'),
            ('Cathrine',   'Maths'),
            ('Cathrine', 'Science'),
            (    'Jack',   'Maths'),
            (    'Jack', 'Science')],
           )